meeting/agenda/2025/02-25.org
:PROPERTIES:
:ID:       B0E6806A-45E9-4301-8B79-CDDEF448B004
:END:
#+title: QT4 CG Meeting 111 Agenda 2025-02-25
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST) 

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/02-18.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 25 February 2025. The following meeting is scheduled
for 4 March 2025. 

** Review of open action items [0/7]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal
+ [ ] QT4CG-097-02: MK to make the XSD schema component references into links to XSD
+ [ ] QT4CG-107-05: JLO and DN to consider a proposal for system defined records.
+ [ ] QT4CG-110-01: MK to fix the incorrect termrefs in the data model the merge the PR.
+ [ ] QT4CG-110-02: MK to review the error pointed out in one of the examples for arrow expressions and then merge
+ [ ] QT4CG-110-03: JWL to consider writing a PR for issue #322, xsl:record instruction
+ [ ] QT4CG-110-04: JK to consider a PR for #366, xsl:use-package with xsl:package-location

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-1766][#1766]]: 1715 Drop array bound checking
+ PR [[https://qt4cg.org/dashboard/#pr-1587][#1587]]: 557 Add fn:binary-resource
+ PR [[https://qt4cg.org/dashboard/#pr-1296][#1296]]: 982 Rewrite of scan-left and scan-right
+ PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]: 77b Update expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1227][#1227]]: 150 PR resubmission for fn ranks

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1837][#1837]]: 1834 Additional clarification on JSON lines
+ PR [[https://qt4cg.org/dashboard/#pr-1826][#1826]]: Fix grammar bug #1818
+ PR [[https://qt4cg.org/dashboard/#pr-1824][#1824]]: 1823 Revise top-level headings in F+O spec
+ PR [[https://qt4cg.org/dashboard/#pr-1814][#1814]]: 1813 Reorganise the XDM spec at top level
+ PR [[https://qt4cg.org/dashboard/#pr-1812][#1812]]: 1811 Add note regarding non-XML chars in xsl:output-character

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/998][#998]]: regular expression addition - lookbehind assertions and lookahead assertions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/119][#119]]: Allow a map's key value to be any sequence

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1833][#1833]]: 583 Drop map:replace and array:replace
+ PR [[https://qt4cg.org/dashboard/#pr-1830][#1830]]: 1829 Reintroduce restrictions on RHS of `=>`
+ PR [[https://qt4cg.org/dashboard/#pr-1828][#1828]]: 1815 Add more detail on annotations of function items
+ PR [[https://qt4cg.org/dashboard/#pr-1825][#1825]]: 1816 New function fn:partial-apply
+ PR [[https://qt4cg.org/dashboard/#pr-1817][#1817]]: 1800 Methods
+ PR [[https://qt4cg.org/dashboard/#pr-1801][#1801]]: 1798 Function fn:function-identity
+ PR [[https://qt4cg.org/dashboard/#pr-1735][#1735]]: 1341 Drop $position callback from many functions
+ PR [[https://qt4cg.org/dashboard/#pr-1740][#1740]]: 1725b Further elaboration of duplicates handling in maps
+ PR [[https://qt4cg.org/dashboard/#pr-1778][#1778]]: 1456 Lookup expressions filtered by type
+ PR [[https://qt4cg.org/dashboard/#pr-1819][#1819]]: 451 Multiple schemas in XSLT

