meeting/agenda/2025/02-25.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 111 Agenda 2025-02-25</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 111 Agenda 2025-02-25</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST) 
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/02-18.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 25 February 2025. The following meeting is scheduled
for 4 March 2025. 
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/7]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-097-02: MK to make the XSD schema component references into links to XSD</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-107-05: JLO and DN to consider a proposal for system defined records.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-110-01: MK to fix the incorrect termrefs in the data model the merge the PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-110-02: MK to review the error pointed out in one of the examples for arrow expressions and then merge</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-110-03: JWL to consider writing a PR for issue #322, xsl:record instruction</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-110-04: JK to consider a PR for #366, xsl:use-package with xsl:package-location</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1766">#1766</a>: 1715 Drop array bound checking</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1587">#1587</a>: 557 Add fn:binary-resource</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1296">#1296</a>: 982 Rewrite of scan-left and scan-right</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>: 77b Update expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1227">#1227</a>: 150 PR resubmission for fn ranks</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1826">#1826</a>: Fix grammar bug #1818</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1824">#1824</a>: 1823 Revise top-level headings in F+O spec</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1814">#1814</a>: 1813 Reorganise the XDM spec at top level</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1812">#1812</a>: 1811 Add note regarding non-XML chars in xsl:output-character</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/119">#119</a>: Allow a map's key value to be any sequence</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1833">#1833</a>: 583 Drop map:replace and array:replace</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1830">#1830</a>: 1829 Reintroduce restrictions on RHS of `=&gt;`</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1828">#1828</a>: 1815 Add more detail on annotations of function items</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1825">#1825</a>: 1816 New function fn:partial-apply</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1817">#1817</a>: 1800 Methods</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1801">#1801</a>: 1798 Function fn:function-identity</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1735">#1735</a>: 1341 Drop $position callback from many functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1740">#1740</a>: 1725b Further elaboration of duplicates handling in maps</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1778">#1778</a>: 1456 Lookup expressions filtered by type</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1819">#1819</a>: 451 Multiple schemas in XSLT</li>
</ul>
</div>
</div>
