meeting/agenda/2025/02-25.org
*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1742][#1742]]: Maps constructed using streamed xsl:fork instruction should not be ordered
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1240][#1240]]: $sequence-of-maps ? info()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1127][#1127]]: Binary resources
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1021][#1021]]: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/967][#967]]: XPath Appendix I: Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/826][#826]]: Arrays: Representation of single members of an array
+ Issue [[https://github.com/qt4cg/qtspecs/issues/748][#748]]: Parse functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/714][#714]]: Function annotations in XSLT
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/501][#501]]: Error handling: Rethrow errors; finally block
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/366][#366]]: Support xsl:use-package with xsl:package-location
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

