meeting/agenda/2025/02-25.org
*** To be triaged
:PROPERTIES:
:CUSTOM_ID: triage
:END:

The following issues need to be triaged.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1836][#1836]]: unparsed-text-lines() - line endings
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1832][#1832]]: Associativity of Operators, especially "||" (Appendix A.5)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1799][#1799]]: "well-formed HTML document"?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1797][#1797]]: elements-to-maps: separate function to construct a plan
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1796][#1796]]: Allow fn:invisible-xml to return a function that returns an item()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1795][#1795]]: Matching values in a map by key
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1794][#1794]]: Lookup: select all except
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1787][#1787]]: Sorted maps revisited
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1786][#1786]]: A case study for XSLT transformation of JSON: the transpiler
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1780][#1780]]: xsl:for-each optional variable introduction
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1775][#1775]]: Navigation in JSON trees
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1774][#1774]]: Nomenclature: relabelling
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1771][#1771]]: fn:deep-equal: map order
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1754][#1754]]: Inverse functions to bin:hex, bin:bin, and bin:octal
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1736][#1736]]: Add option retain-order=false when constructing maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1718][#1718]]: Ordered Maps: positions in callback functions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1704][#1704]]: Ignore the byte order mark more completely/globally
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1702][#1702]]: Node Updates: Functions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1697][#1697]]: Add documentary names to callback function signatures
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1661][#1661]]: QName arguments: also allow strings
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1660][#1660]]: Further suggestions for fn:path
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1658][#1658]]: fn:elements-to-maps: `empty`, normalize space ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1656][#1656]]: Ordered Maps: Updates
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1648][#1648]]: fn:elements-to-maps: Types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1647][#1647]]: fn:elements-to-maps: Explicit Layouts
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1646][#1646]]: fn:elements-to-maps: Robustness
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1645][#1645]]: fn:elements-to-maps: Debugging
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1644][#1644]]: fn:elements-to-maps: Mixed Content
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1624][#1624]]: document-node(a|b) is the same type as document-node(a)|document-node(b)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1618][#1618]]: Adaptive serialization: doubles
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1591][#1591]]: Implausible filter expressions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1583][#1583]]: JSON: Parsing and serializing numbers, often undesired E notation
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1568][#1568]]: Define a Unicode case-insensitive collation
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1566][#1566]]: EXPath Modules: Future
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1528][#1528]]: Computed node constructors: observations
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1520][#1520]]: Type declarations of cyclically dependent modules
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1514][#1514]]: Editorial: optional position argument in function signature for for-each and other HOF 
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1484][#1484]]: Functions that expect a record type should make it extensible
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1479][#1479]]: Default element namespace in XQuery: interaction of 'fixed' and '##any'
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1459][#1459]]: Function properties and arities (editorial)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1416][#1416]]: Key-value pairs: built-in record type `pair`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1363][#1363]]: map:get and array:get
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1340][#1340]]: Namespace nodes and the namespace axis
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1338][#1338]]: Arrays and maps: Members, entries, values, contents, pairs, …
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1319][#1319]]: Specification Documents: Editors and Contributors
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1310][#1310]]: add fn:match-groups() function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1307][#1307]]: For symmetry, add functions array:scan-left and array:scan-right
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1271][#1271]]: Schema validation in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1175][#1175]]: XPath: Optional parameters in the definition of an inline function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/760][#760]]: Serialize functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/641][#641]]: Serialization fallback.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/119][#119]]: Allow a map's key value to be any sequence

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Review of pull requests
:PROPERTIES:
:CUSTOM_ID: h-56701D3D-85D4-4DB5-A22C-D565BB8AC7C8
:END:

I don’t actually think we’ll get through all of these. Let’s reserve 15 minutes
at the end of the call for issue triage. See the list below.

*** PR #1833: 583 Drop map:replace and array:replace
:PROPERTIES:
:CUSTOM_ID: pr-1833
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1833][#1833]]
*** PR #1830: 1829 Reintroduce restrictions on RHS of `=>`
:PROPERTIES:
:CUSTOM_ID: pr-1830
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1830][#1830]]
*** PR #1828: 1815 Add more detail on annotations of function items
:PROPERTIES:
:CUSTOM_ID: pr-1828
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1828][#1828]]
*** PR #1825: 1816 New function fn:partial-apply
:PROPERTIES:
:CUSTOM_ID: pr-1825
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1825][#1825]]
*** PR #1817: 1800 Methods
:PROPERTIES:
:CUSTOM_ID: pr-1817
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1817][#1817]]
*** PR #1801: 1798 Function fn:function-identity
:PROPERTIES:
:CUSTOM_ID: pr-1801
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1801][#1801]]
*** PR #1735: 1341 Drop $position callback from many functions
:PROPERTIES:
:CUSTOM_ID: pr-1735
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1735][#1735]]
*** PR #1740: 1725b Further elaboration of duplicates handling in maps
:PROPERTIES:
:CUSTOM_ID: pr-1740
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1740][#1740]]
*** PR #1778: 1456 Lookup expressions filtered by type
:PROPERTIES:
:CUSTOM_ID: pr-1778
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1778][#1778]]
*** PR #1819: 451 Multiple schemas in XSLT
:PROPERTIES:
:CUSTOM_ID: pr-1819
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1819][#1819]]

** Issue triage
:PROPERTIES:
:CUSTOM_ID: h-7CAD61CE-1274-49A6-AC7D-4CA305A474F4
:END:

*** Issue #1836: unparsed-text-lines() - line endings
:PROPERTIES:
:CUSTOM_ID: issue-1836
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/1836][#1836]]
*** Issue #1832: Associativity of Operators, especially "||" (Appendix A.5)
:PROPERTIES:
:CUSTOM_ID: issue-1832
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/1832][#1832]]
*** Issue #1799: "well-formed HTML document"?
:PROPERTIES:
:CUSTOM_ID: issue-1799
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/1799][#1799]]
*** Issue #1797: elements-to-maps: separate function to construct a plan
:PROPERTIES:
:CUSTOM_ID: issue-1797
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/1797][#1797]]
*** Issue #760: Serialize functions: consistency
:PROPERTIES:
:CUSTOM_ID: issue-760
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/760][#760]]
