meeting/agenda/2025/02-25.html

<div id="outline-container-triage" class="outline-4">
<h4 id="triage"><span class="section-number-4">1.6.6.</span> To be triaged</h4>
<div class="outline-text-4" id="text-triage">
<p>
The following issues need to be triaged.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1836">#1836</a>: unparsed-text-lines() - line endings</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1832">#1832</a>: Associativity of Operators, especially "||" (Appendix A.5)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1799">#1799</a>: "well-formed HTML document"?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1797">#1797</a>: elements-to-maps: separate function to construct a plan</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1796">#1796</a>: Allow fn:invisible-xml to return a function that returns an item()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1795">#1795</a>: Matching values in a map by key</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1794">#1794</a>: Lookup: select all except</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1787">#1787</a>: Sorted maps revisited</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1786">#1786</a>: A case study for XSLT transformation of JSON: the transpiler</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1780">#1780</a>: xsl:for-each optional variable introduction</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1775">#1775</a>: Navigation in JSON trees</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1774">#1774</a>: Nomenclature: relabelling</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1771">#1771</a>: fn:deep-equal: map order</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1754">#1754</a>: Inverse functions to bin:hex, bin:bin, and bin:octal</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1736">#1736</a>: Add option retain-order=false when constructing maps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1718">#1718</a>: Ordered Maps: positions in callback functions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1704">#1704</a>: Ignore the byte order mark more completely/globally</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1702">#1702</a>: Node Updates: Functions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1697">#1697</a>: Add documentary names to callback function signatures</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1661">#1661</a>: QName arguments: also allow strings</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1660">#1660</a>: Further suggestions for fn:path</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1658">#1658</a>: fn:elements-to-maps: `empty`, normalize space ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1656">#1656</a>: Ordered Maps: Updates</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1648">#1648</a>: fn:elements-to-maps: Types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1647">#1647</a>: fn:elements-to-maps: Explicit Layouts</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1646">#1646</a>: fn:elements-to-maps: Robustness</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1645">#1645</a>: fn:elements-to-maps: Debugging</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1644">#1644</a>: fn:elements-to-maps: Mixed Content</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1624">#1624</a>: document-node(a|b) is the same type as document-node(a)|document-node(b)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1618">#1618</a>: Adaptive serialization: doubles</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1591">#1591</a>: Implausible filter expressions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1583">#1583</a>: JSON: Parsing and serializing numbers, often undesired E notation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1568">#1568</a>: Define a Unicode case-insensitive collation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1566">#1566</a>: EXPath Modules: Future</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1528">#1528</a>: Computed node constructors: observations</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1520">#1520</a>: Type declarations of cyclically dependent modules</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1514">#1514</a>: Editorial: optional position argument in function signature for for-each and other HOF</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1484">#1484</a>: Functions that expect a record type should make it extensible</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1479">#1479</a>: Default element namespace in XQuery: interaction of 'fixed' and '##any'</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1459">#1459</a>: Function properties and arities (editorial)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1416">#1416</a>: Key-value pairs: built-in record type `pair`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1363">#1363</a>: map:get and array:get</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1340">#1340</a>: Namespace nodes and the namespace axis</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1338">#1338</a>: Arrays and maps: Members, entries, values, contents, pairs, …</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1319">#1319</a>: Specification Documents: Editors and Contributors</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1310">#1310</a>: add fn:match-groups() function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1307">#1307</a>: For symmetry, add functions array:scan-left and array:scan-right</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1271">#1271</a>: Schema validation in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1175">#1175</a>: XPath: Optional parameters in the definition of an inline function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/760">#760</a>: Serialize functions: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/641">#641</a>: Serialization fallback.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/119">#119</a>: Allow a map's key value to be any sequence</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-h-56701D3D-85D4-4DB5-A22C-D565BB8AC7C8" class="outline-3">
<h3 id="h-56701D3D-85D4-4DB5-A22C-D565BB8AC7C8"><span class="section-number-3">2.1.</span> Review of pull requests</h3>
<div class="outline-text-3" id="text-h-56701D3D-85D4-4DB5-A22C-D565BB8AC7C8">
<p>
I don’t actually think we’ll get through all of these. Let’s reserve 15 minutes
at the end of the call for issue triage. See the list below.
</p>
</div>
